Ludovic-Lesur/stm32l0xx-drivers/src/aes.c
/*
 * aes.c
 *
 *  Created on: 01 aug. 2024
 *      Author: Ludo
 */

#ifndef STM32L0XX_DRIVERS_DISABLE_FLAGS_FILE
#include "stm32l0xx_drivers_flags.h"
#endif

#ifndef STM32L0XX_DRIVERS_DISABLE

#include "aes.h"

#include "aes_registers.h"
#include "rcc_registers.h"
#include "types.h"

/*** AES local macros ***/

#define AES_TIMEOUT_COUNT   1000000

/*** AES local structures ***/

/*******************************************************************/
typedef struct {
    uint8_t init_count;
} AES_context_t;

/*** AES local global variables ***/

static AES_context_t aes_ctx = {
    .init_count = 0
};

/*** AES functions ***/

/*******************************************************************/
void AES_init(void) {
    // Enable peripheral clock.
    RCC->AHBENR |= (0b1 << 24); // CRYPTOEN='1'.
    // Configure peripheral.
    AES->CR |= (0b01 << 5); // CBC algorithm (CHMOD='01').
    // Update initialization count.
    aes_ctx.init_count++;
}

/*******************************************************************/
void AES_de_init(void) {
    // Update initialization count.
    if (aes_ctx.init_count > 0) {
        aes_ctx.init_count--;
    }
    // Check initialization count.
    if (aes_ctx.init_count > 0) goto errors;
    // Disable peripheral clock.
    RCC->AHBENR &= ~(0b1 << 24); // CRYPTOEN='0'.
errors:
    return;
}

/*******************************************************************/
AES_status_t AES_encrypt(uint8_t* data_in, uint8_t* data_out, uint8_t* key) {
    // Local variables.
    AES_status_t status = AES_SUCCESS;
    uint8_t idx = 0;
    uint32_t data_32bits = 0;
    uint32_t loop_count = 0;
    // Check state.
    if (aes_ctx.init_count == 0) {
        status = AES_ERROR_UNINITIALIZED;
        goto errors;
    }
    // Check parameters.
    if ((data_in == NULL) || (data_out == NULL) || (key == NULL)) {
        status = AES_ERROR_NULL_PARAMETER;
        goto errors;
    }
    // Fill key and reset initialization vector.
    for (idx = 0; idx < 4; idx++) {
        // Build 32-bits word.
        data_32bits = 0;
        data_32bits |= key[(idx << 2) + 0] << 24;
        data_32bits |= key[(idx << 2) + 1] << 16;
        data_32bits |= key[(idx << 2) + 2] << 8;
        data_32bits |= key[(idx << 2) + 3] << 0;
        // Fill registers.
        AES->KEYR[3 - idx] = data_32bits;
        AES->IVR[idx] = 0;
    }
    // Enable peripheral.
    AES->CR |= (0b1 << 0); // EN='1'.
    // Fill input data (provided most significant 32-bits word first).
    for (idx = 0; idx < 4; idx++) {
        // Build 32-bits word.
        data_32bits = 0;
        data_32bits |= data_in[(idx << 2) + 0] << 24;
        data_32bits |= data_in[(idx << 2) + 1] << 16;
        data_32bits |= data_in[(idx << 2) + 2] << 8;
        data_32bits |= data_in[(idx << 2) + 3] << 0;
        // Fill input data register.
        AES->DINR = data_32bits;
    }
    // Wait for algorithm to complete.
    while (((AES->SR) & (0b1 << 0)) == 0) {
        // Wait for CCF='1' or timeout.
        loop_count++;
        if (loop_count > AES_TIMEOUT_COUNT) {
            status = AES_ERROR_TIMEOUT;
            goto errors;
        }
    }
    // Get result (returned most significant 32-bits word first).
    for (idx = 0; idx < 4; idx++) {
        // Read output data register (most significant 32-bits word first).
        data_32bits = (AES->DOUTR);
        // Split 32-bits word into 4 bytes.
        data_out[(idx << 2) + 0] = (uint8_t) ((data_32bits >> 24) & 0xFF);
        data_out[(idx << 2) + 1] = (uint8_t) ((data_32bits >> 16) & 0xFF);
        data_out[(idx << 2) + 2] = (uint8_t) ((data_32bits >> 8) & 0xFF);
        data_out[(idx << 2) + 3] = (uint8_t) ((data_32bits >> 0) & 0xFF);
    }
    // Reset peripheral.
    AES->CR |= (0b1 << 7); // Clear CCF flag for next AES operation.
    AES->CR &= ~(0b1 << 0); // EN='0'.
errors:
    return status;
}

#endif /* STM32L0XX_DRIVERS_DISABLE */
